In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("./priceperunitarea_Villas.csv")

In [3]:
df.head()

,date,عدد غرف النوم,سكني أو تجاري,c_type,غرفة سائق,دوبلكس,مسبح,price,مدة الإيجار,area,اتجاه الشارع,عرض الشارع,sale_or_rent,district_name_ar,district_name_en,year,Price Per Unit Area
0,12/04/2016 3:15,5,غير محدد,فيلا,غرفة سائق,ليست دوبلكس,مسبح,3000000,غير محدد,400,شمال,10,للبيع,العليا,Al Ulaya,2016,7500
1,14/05/2015 19:53,3,غير محدد,فيلا,غرفة سائق,ليست دوبلكس,لا يوجد مسبح,1700000,غير محدد,373,جنوب,15,للبيع,النرجس,An Narjis,2015,4558
2,19/08/2016 13:42,3,غير محدد,فيلا,غرفة سائق,ليست دوبلكس,لا يوجد مسبح,1700000,غير محدد,438,شمال,15,للبيع,العارض,Al Arid,2016,3881
3,18/11/2015 17:52,5,غير محدد,فيلا,لا يوجد غرفة سائق,ليست دوبلكس,لا يوجد مسبح,900000,غير محدد,625,جنوب غربي,15,للبيع,ديراب,Dirab,2015,1440
4,18/08/2016 13:42,4,غير محدد,فيلا,غرفة سائق,ليست دوبلكس,لا يوجد مسبح,920000,غير محدد,280,شمال,20,للبيع,الرمال,Ar Rimal,2016,3286

In [4]:
 df1 = df.drop(['date', 'عدد غرف النوم', 'سكني أو تجاري','c_type','غرفة سائق','مسبح','price','مدة الإيجار','area','sale_or_rent','district_name_ar','اتجاه الشارع','عرض الشارع','دوبلكس'], axis=1, inplace=False)

In [5]:
df1.shape

(17665, 3)

In [6]:
df1.head()

  district_name_en  year  Price Per Unit Area
0         Al Ulaya  2016                 7500
1        An Narjis  2015                 4558
2          Al Arid  2016                 3881
3            Dirab  2015                 1440
4         Ar Rimal  2016                 3286

In [7]:
df1.district_name_en.nunique()

137

Create pivot table to calculate the average per year for (Price Per Unit Area) column for each distinct district.

In [8]:
AveragePricePerUnitArea = df.pivot_table("Price Per Unit Area", index='district_name_en', columns='year', aggfunc='mean')

In [9]:
AveragePricePerUnitArea.head()

year                2014         2015         2016
district_name_en
Ad Dar Al Baida   2865.1  2795.191176  2679.462264
Ad Duraihimiyah   3333.0          NaN          NaN
Adh Dhubbat          NaN  5146.500000  3784.500000
Al Amal              NaN  3968.000000          NaN
Al Andalus        2600.0  3720.956522  3795.148148

Drop rows that have Null values in more than one year:

In [10]:
AveragePricePerUnitArea = AveragePricePerUnitArea.dropna(thresh=2)

In [11]:
AveragePricePerUnitArea.head()

year                     2014         2015         2016
district_name_en
Ad Dar Al Baida   2865.100000  2795.191176  2679.462264
Adh Dhubbat               NaN  5146.500000  3784.500000
Al Andalus        2600.000000  3720.956522  3795.148148
Al Aqiq           5222.000000  4681.448276  5063.217391
Al Arid           4018.166667  4255.821918  4202.824380

In [10]:
AveragePricePerUnitArea.shape

(116, 3)

22 districts droped because they had missing data in more than one year.

Then, Replace the nulls values of the few districts that had it in one year by taking the average of the two available prices.

In [11]:
AveragePricePerUnitArea = AveragePricePerUnitArea.apply(lambda row: row.fillna(row.mean()), axis=1)

To convert Price Per Unit Area values to integers we use:

In [12]:
AveragePricePerUnitArea  = AveragePricePerUnitArea.astype(int)

Finally, save it to use it in the d3.js dashboard.

In [13]:
#AveragePricePerUnitArea.to_csv("avgperunitarea__Villa.csv")

Now, I want to compute the total offers that was available during the three years 2014, 2015, and 2016 for each district, which indicate number of newly built houses that could indicate where the demand is taking place. Furthermore, it could indicate that sitizens are being moved to other new districts and trying to sell thair old house.

In [14]:
OffersPerdistrict_Villas = df.groupby('district_name_en', sort=True)["district_name_en"].count().reset_index(name ='Total_offers')

In [15]:
OffersPerdistrict_Villas.head()

  district_name_en  Total_offers
0  Ad Dar Al Baida           184
1  Ad Duraihimiyah             1
2      Adh Dhubbat             8
3          Al Amal             1
4       Al Andalus            52

Perfect! I need it in the dashboard too, so I will save it.

In [16]:
#OffersPerdistrict_Villas.to_csv("OffersPerdistrict_Villas.csv")

####################################################################################################################

####################################################################################################################

Next, I need to load the CSV file belong to the apartments for rent.

In [17]:
df2 = pd.read_csv("./PricePerDistrict_Apartments.csv")

In [18]:
 df3 = df2.drop(['date', 'عدد غرف النوم', 'سكني أو تجاري','c_type','غرفة سائق','مسبح','مدة الإيجار','area','sale_or_rent','district_name_ar','اتجاه الشارع','عرض الشارع','دوبلكس'], axis=1, inplace=False)

In [19]:
df3.head()

   price district_name_en  year
0  12000          Utaiqah  2016
1  40000     Al Mughrizat  2016
2  20000       Ishbiliyah  2016
3  27000        Al Yarmuk  2016
4  30000       Ishbiliyah  2016

Now, We have to compute Average prices for each year per district using Pivot table

In [20]:
AveragePrice = df3.pivot_table("price", index='district_name_en', columns='year', aggfunc='mean')

In [21]:
AveragePrice.shape

(148, 3)

Drop rows that have Null values in more than one year:

In [22]:
AveragePrice = AveragePrice.dropna(thresh=2)

In [23]:
AveragePrice.shape

(126, 3)

22 districts droped because they had missing data in more than one year.

Then, Replace the nulls values of the few districts that had it in one year by taking the average of the two available prices.

In [24]:
AveragePrice = AveragePrice.apply(lambda row: row.fillna(row.mean()), axis=1)

To convert Price column values to integers we use:

In [25]:
AveragePrice=AveragePrice.astype(int)

Finally, save it to use it in the d3.js second dashboard.

In [26]:
#AveragePrice.to_csv("AveragePricePerDistrict_Apartments.csv")

We need to know how many rental offers are available for each district for apartments

In [27]:
OffersPerdistrict__Apartments = df3.groupby('district_name_en', sort=True)["district_name_en"].count().reset_index(name ='Total_offers')

In [28]:
OffersPerdistrict__Apartments.head()

  district_name_en  Total_offers
0  Ad Dar Al Baida           219
1         Ad Dirah             3
2       Ad Dubiyah             4
3  Ad Duraihimiyah             3
4      Adh Dhubbat            38

I need to save it to use it in the second d3.js dashboard.

In [28]:
#OffersPerdistrict_Apartments.to_csv("OffersPerdistrict__Apartments.csv")